Tekla Open API Reference for Tekla Structures 2025
RebarHookData Class
 The RebarHookData class defines the hook at the end of a reinforcing bar. Hooks are used for anchoring purposes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarHookData
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarHookData
<SerializableAttribute>
Public NotInheritable Class RebarHookData
The RebarHookData type exposes the following members.
Constructors
Name | Description
RebarHookData
 Instantiates a rebar hook data instance with empty members.
Top
Properties
Name | Description
Angle
 The angle of the hook. The value is between -270 to +270 degrees.
Length
 The length of the straight part of the hook.
Radius
 The bending radius of the hook.
Shape
 Defines the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.
Top
See Also
Reference
Tekla.Structures.Model Namespace